"""
Градиент функции
Минимум функции потерь не всегда можно найти вручную. Разобраться,
в каком он направлении, поможет градиент функции (англ. function
gradient).
Функция потерь зависит от параметров алгоритма. Эта функция
векторная (англ. vector-valued function), то есть она
принимает на вход вектор, а возвращает скаляр.
Градиент векторной функции — это вектор, состоящий
из производных ответа по каждому аргументу. Градиент на письме
часто обозначают символом ∇∇, который называется оператор набла.
"""