# Операции с элементами матриц
# С элементами матриц можно делать всё то же, что и с элементами
# векторов.

# Мобильный оператор «Шмеляйн» собрал недельную статистику по
# пяти клиентам. Постройте матрицу: сколько за неделю клиенты
# суммарно потратили минут разговора, СМС и интернет-трафика.
# Напечатайте её на экране (уже в прекоде).
# Постройте прогноз на месяц. По недельным данным найдите,
# сколько каждый клиент в среднем использует сервисы за день.
# Затем умножьте это среднее значение на 30 (количество дней в
# следующем месяце).

import numpy as np
import pandas as pd

services = ['Минуты', 'СМС', 'Мбайты']

monday = np.array([
    [10, 2, 72],
    [3, 5, 111],
    [15, 3, 50],
    [27, 0, 76],
    [7, 1, 85]])

tuesday = np.array([
    [33, 0, 108],
    [21, 5, 70],
    [15, 2, 15],
    [29, 6, 34],
    [2, 1, 146]])

wednesday = np.array([
    [16, 0, 20],
    [23, 5, 34],
    [5, 0, 159],
    [35, 1, 74],
    [5, 0, 15]])

thursday = np.array([
    [25, 1, 53],
    [15, 0, 26],
    [10, 0, 73],
    [18, 1, 24],
    [2, 2, 24]])

friday = np.array([
    [32, 0, 33],
    [4, 0, 135],
    [2, 2, 21],
    [18, 5, 56],
    [27, 2, 21]])

saturday = np.array([
    [28, 0, 123],
    [16, 5, 165],
    [10, 1, 12],
    [42, 4, 80],
    [18, 2, 20]])

sunday = np.array([
    [30, 4, 243],
    [18, 2, 23],
    [12, 2, 18],
    [23, 0, 65],
    [34, 0, 90]])

weekly = monday + tuesday + wednesday + thursday + friday + sunday + saturday

print('В неделю')
print(pd.DataFrame(weekly, columns=services))
print()

forecast = weekly * 30 / 7

print('Прогноз на месяц')
print(pd.DataFrame(forecast, dtype=int, columns=services))