# 3. Создайте два отдельных списка двумерных векторов с оценками
# клиентов, которые пришли с первого сайта-агрегатора (масс-маркет)
# и со второго (люкс). Назовите переменные clients_1 и clients_2,
# а потом напечатайте их значения на экране.

# Оценки клиентов с первого сайта-агрегатора сосредоточены в правой
# нижней области (Цена>60 и Качество<40); со второго — в левой
# верхней области, ограниченной координатами <40 и >60.

import numpy as np
import pandas as pd

reviews_values = [
    [68,18], [81,19], [81,22], [15,75], [75,15], [17,72],
    [24,75], [21,91], [76, 6], [12,74], [18,83], [20,62],
    [21,82], [21,79], [84,15], [73,16], [88,25], [78,23],
    [32, 81], [77, 35]]
reviews = pd.DataFrame(reviews_values, columns=['Цена', 'Качество'])

clients_1 = []
clients_2 = []

for client in list(reviews.values):
    if (client[0] > 60 and client[1] < 40):
        clients_1.append(client.tolist())
    elif (client[0] < 40 and client[1] > 60):
        clients_2.append(client.tolist())

print("Оценки пришедших с первого агрегатора:", clients_1)
print("Оценки пришедших со второго агрегатора:", clients_2)